In [1]:
s = """
Titanic Machine learning from disaster

Columns     DESCRIPTION:
survival	Survival	            0 = No, 1 = Yes
pclass      Ticket class	        1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex	
Age	        Age in years	
sibsp	    # of siblings / spouses aboard the Titanic	
parch	    # of parents / children aboard the Titanic	
ticket	    Ticket number	
fare	    Passenger fare	
cabin	    Cabin number	
embarked	Port of Embarkation	    C = Cherbourg, Q = Queenstown, S = Southampton

"""
print(s)

Titanic Machine learning from disaster

Columns     DESCRIPTION:
survival	Survival	            0 = No, 1 = Yes
pclass      Ticket class	        1 = 1st, 2 = 2nd, 3 = 3rd
sex	        Sex
Age	        Age in years
sibsp	    # of siblings / spouses aboard the Titanic
parch	    # of parents / children aboard the Titanic
ticket	    Ticket number
fare	    Passenger fare
cabin	    Cabin number
embarked	Port of Embarkation	    C = Cherbourg, Q = Queenstown, S = Southampton

In [26]:
import os
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import warnings
import seaborn as sns
from sklearn.linear_model import LogisticRegression
from sklearn.linear_model import LinearRegression
from  sklearn.ensemble import RandomForestClassifier
warnings.filterwarnings(action = 'ignore')

In [33]:
PATH = "..\Titanic - Machine learning from disaster\\titanic"
    
FILES = os.listdir(PATH)

xTrain = pd.read_csv(PATH + "\\" + FILES[2])

xTest = pd.read_csv(PATH + "\\" + FILES[1])

_X = xTrain.drop(columns = 'Survived', inplace = False)
y = xTrain['Survived']

X = pd.concat([_X, xTest], axis = 0)

X.shape

(1309, 11)

In [34]:
X.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
xTest.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
s = """
Useless features:
    1. passengerID  : random numbers
    2. Cabin number : lot's of NaN value
    3. Ticket number
Feature engineering :
    1. Name : extract titles Mr. Mrs. Dr. 
    2. SipSb Parch : family size
Others:
    1. Pclass : categorical
    2. Sex : categorical
    3. Fare : continuous
    4. Embarked : categorical 
    5. Age : continuous
"""

print(s)

Useless features:
    1. passengerID  : random numbers
    2. Cabin number : lot's of NaN value
    3. Ticket number
Feature engineering :
    1. Name : extract titles Mr. Mrs. Dr.
    2. SipSb Parch : family size
Others:
    1. Pclass : categorical
    2. Sex : categorical
    3. Fare : continuous
    4. Embarked : categorical
    5. Age : continuous

In [8]:
useless = ['PassengerId', 'Cabin', 'Ticket']
forFeatEx = ['Name', 'SibSp', 'Parch']
rest = ['Pclass', 'Sex', 'Fare', 'Embarked', 'Age']

In [36]:
# remove useless features
_x = X.drop(columns = useless)
_x.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [10]:
# feature extration with name
def featEx_name(df):
    trainL = []
    for _strain in list(df.Name):
        _s = _strain.split(", ")[1]
        trainL.append(_s.split(" ")[0])
    df['Salutation'] = trainL
    return df
def featEx_familySize(df):
    parch = list(df.Parch)
    sibsb = list(df.SibSp)
    familySize = [parch[i] + sibsb[i] for i in range(len(parch))]
    df['FamSize'] = familySize
    return df

In [37]:
__x = featEx_name(_x)
__x.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Salutation
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,Mr.
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,Mrs.
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,Miss.
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,Mrs.
4,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,Mr.

In [38]:
__x = featEx_familySize(__x)
__x.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Salutation,FamSize
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,Mr.,1
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,Mrs.,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,Miss.,0
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,Mrs.,1
4,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,Mr.,0

In [39]:
def createDumm(df, cols):
    for c in cols:
        d = pd.get_dummies(df[c])
        df = pd.concat([df, d], axis = 1)
    return df

categorical = ['Pclass', 'Sex', 'Embarked', 'Salutation']
__x= createDumm(__x, cols = categorical)
__x = __x.drop(columns = categorical, inplace = False)

__x.head()

,Name,Age,SibSp,Parch,Fare,FamSize,1,2,3,female,...,Master.,Miss.,Mlle.,Mme.,Mr.,Mrs.,Ms.,Rev.,Sir.,the
0,"Braund, Mr. Owen Harris",22.0,1,0,7.2500,1,0,0,1,0,...,0,0,0,0,1,0,0,0,0,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,71.2833,1,1,0,0,1,...,0,0,0,0,0,1,0,0,0,0
2,"Heikkinen, Miss. Laina",26.0,0,0,7.9250,0,0,0,1,1,...,0,1,0,0,0,0,0,0,0,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,53.1000,1,1,0,0,1,...,0,0,0,0,0,1,0,0,0,0
4,"Allen, Mr. William Henry",35.0,0,0,8.0500,0,0,0,1,0,...,0,0,0,0,1,0,0,0,0,0

In [14]:
__x = __x.drop(columns = ['Name'])
__x.head()

,Age,SibSp,Parch,Fare,FamSize,1,2,3,female,male,...,Master.,Miss.,Mlle.,Mme.,Mr.,Mrs.,Ms.,Rev.,Sir.,the
0,22.0,1,0,7.2500,1,0,0,1,0,1,...,0,0,0,0,1,0,0,0,0,0
1,38.0,1,0,71.2833,1,1,0,0,1,0,...,0,0,0,0,0,1,0,0,0,0
2,26.0,0,0,7.9250,0,0,0,1,1,0,...,0,1,0,0,0,0,0,0,0,0
3,35.0,1,0,53.1000,1,1,0,0,1,0,...,0,0,0,0,0,1,0,0,0,0
4,35.0,0,0,8.0500,0,0,0,1,0,1,...,0,0,0,0,1,0,0,0,0,0

In [52]:
# lots of NaN values in TRAIN::age, TEST::age, and 1 NaN value in TEST::fare
#__x.fillna(__x.mean(), inplace = True)

#

def imput(X, mode = 'mean'):
    if mode == 'mean':
        _X = X.fillna(X.mean(), inplace = False)
    elif mode == 'reg':
        return 0
    return _X

#__x = imput(__x, mode = 'mean')
__x.isna().sum()

Name           0
Age          263
SibSp          0
Parch          0
Fare           1
FamSize        0
1              0
2              0
3              0
female         0
male           0
C              0
Q              0
S              0
Capt.          0
Col.           0
Don.           0
Dona.          0
Dr.            0
Jonkheer.      0
Lady.          0
Major.         0
Master.        0
Miss.          0
Mlle.          0
Mme.           0
Mr.            0
Mrs.           0
Ms.            0
Rev.           0
Sir.           0
the            0
dtype: int64

In [24]:
#visualizing heat map. 
__x.columns

Index([      'Age',     'SibSp',     'Parch',      'Fare',   'FamSize',
                 1,           2,           3,    'female',      'male',
               'C',         'Q',         'S',     'Capt.',      'Col.',
            'Don.',     'Dona.',       'Dr.', 'Jonkheer.',     'Lady.',
          'Major.',   'Master.',     'Miss.',     'Mlle.',      'Mme.',
             'Mr.',      'Mrs.',       'Ms.',      'Rev.',      'Sir.',
             'the'],
      dtype='object')

In [18]:
def useLR(X, y):
    _lenofy = y.shape[0]
    xtrain = X[0:_lenofy]
    xtest = X[_lenofy:]
    
    lr = LogisticRegression()
    
    lr.fit(xtrain, y)
    
    return lr.predict(xtest)
def Linreg ( trainx, trainy, testx):
    linr = LinearRegression()
    
    linr.fit(trainx, trainy)
    
    return linr.predict(testx)

In [27]:
res = useLR(__x, y)
res
data = {'PassengerId' : list(range(892, 1310)), 'Survived' : res }

df = pd.DataFrame(data)
df.to_csv("result.csv")
#_train[0:10]
#train.head

In [61]:
for i in range(__x.shape[0]):
    imptrainx = []
    imptrainy = []
    imptest = []
    if __x.iloc[i]['Age'] == np.nan:
        imptest.append(__x.iloc[i])
imptest

L = list(__x.isna()['Age'])
test = []
for i in range(len(L)):
    if L[i] == False:
        print(i, end = " ")

0 1 2 3 4 6 7 8 9 10 11 12 13 14 15 16 18 20 21 22 23 24 25 27 30 33 34 35 37 38 39 40 41 43 44 49 50 51 52 53 54 56 57 58 59 60 61 62 63 66 67 68 69 70 71 72 73 74 75 78 79 80 81 83 84 85 86 88 89 90 91 92 93 94 96 97 98 99 100 102 103 104 105 106 108 110 111 112 113 114 115 116 117 118 119 120 122 123 124 125 127 129 130 131 132 133 134 135 136 137 138 139 141 142 143 144 145 146 147 148 149 150 151 152 153 155 156 157 160 161 162 163 164 165 167 169 170 171 172 173 174 175 177 178 179 182 183 184 187 188 189 190 191 192 193 194 195 197 199 200 202 203 204 205 206 207 208 209 210 211 212 213 215 216 217 218 219 220 221 222 224 225 226 227 228 230 231 232 233 234 236 237 238 239 242 243 244 245 246 247 248 249 251 252 253 254 255 257 258 259 261 262 263 265 266 267 268 269 271 272 273 275 276 278 279 280 281 282 283 285 286 287 288 289 290 291 292 293 294 296 297 299 302 305 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323 325 326 327 328 329 331 332 333 336 337 338 339 340 341 342 343 344 345 346 348 349 350 352 353 355 356 357 360 361 362 363 365 366 369 370 371 372 373 374 376 377 378 379 380 381 382 383 385 386 387 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 412 414 416 417 418 419 421 422 423 424 426 427 429 430 432 433 434 435 436 437 438 439 440 441 442 443 445 446 447 448 449 450 452 453 455 456 458 460 461 462 463 465 467 469 471 472 473 474 476 477 478 479 480 482 483 484 486 487 488 489 491 492 493 494 496 498 499 500 501 503 504 505 506 508 509 510 512 513 514 515 516 518 519 520 521 523 525 526 528 529 530 532 534 535 536 537 539 540 541 542 543 544 545 546 548 549 550 551 553 554 555 556 558 559 561 562 565 566 567 569 570 571 572 574 575 576 577 579 580 581 582 583 585 586 587 588 590 591 592 594 595 597 599 600 603 604 605 606 607 608 609 610 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 630 631 632 634 635 636 637 638 640 641 642 644 645 646 647 649 651 652 654 655 657 658 659 660 661 662 663 664 665 666 668 670 671 672 673 675 676 677 678 679 681 682 683 684 685 686 687 688 689 690 691 693 694 695 696 698 699 700 701 702 703 704 705 706 707 708 710 712 713 714 715 716 717 719 720 721 722 723 724 725 726 728 729 730 731 733 734 735 736 737 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755 756 757 758 759 761 762 763 764 765 767 769 770 771 772 774 775 777 779 780 781 782 784 785 786 787 788 789 791 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809 810 811 812 813 814 816 817 818 819 820 821 822 823 824 827 829 830 831 833 834 835 836 838 840 841 842 843 844 845 847 848 850 851 852 853 854 855 856 857 858 860 861 862 864 865 866 867 869 870 871 872 873 874 875 876 877 879 880 881 882 883 884 885 886 887 889 890 891 892 893 894 895 896 897 898 899 900 902 903 904 905 906 907 908 909 910 911 912 914 915 916 917 918 919 921 922 923 925 926 928 929 931 933 934 935 936 937 939 940 941 942 943 944 946 947 948 950 951 952 953 954 955 957 958 959 960 961 962 963 964 965 966 968 969 970 971 972 973 977 978 980 981 983 985 986 987 988 989 990 991 992 994 995 996 997 1000 1001 1003 1004 1005 1006 1008 1009 1010 1011 1013 1014 1016 1017 1019 1020 1021 1022 1025 1026 1027 1028 1029 1030 1031 1032 1033 1034 1035 1036 1038 1040 1041 1043 1044 1045 1046 1047 1048 1049 1050 1052 1053 1055 1056 1057 1058 1060 1062 1063 1065 1066 1067 1068 1069 1070 1071 1072 1073 1075 1076 1077 1078 1080 1081 1083 1084 1085 1086 1087 1088 1089 1092 1093 1094 1095 1097 1098 1099 1100 1101 1103 1104 1105 1106 1108 1109 1111 1112 1113 1114 1115 1117 1119 1120 1121 1122 1123 1125 1126 1127 1128 1129 1130 1131 1132 1133 1136 1137 1138 1139 1141 1142 1143 1144 1145 1148 1149 1150 1151 1152 1153 1154 1155 1160 1161 1163 1166 1167 1168 1169 1170 1171 1172 1174 1175 1176 1178 1182 1184 1185 1186 1187 1189 1190 1191 1193 1194 1196 1197 1198 1199 1200 1201 1202 1204 1205 1206 1207 1208 1209 1210 1211 1212 1213 1214 1215 1216 1217 1218 1219 1220 1221 1222 1224 1225 1226 1227 1228 1229 1231 1232 1234 1236 1237 1238 1239 1240 1241 1242 1243 1244 1245 1246 1247 1250 1251 1252 1253 1254 1255 1258 1259 1260 1261 1262 1263 1264 1265 1266 1267 1268 1269 1270 1272 1274 1276 1277 1278 1279 1280 1281 1282 1283 1284 1285 1286 1287 1288 1289 1290 1291 1292 1293 1294 1295 1296 1297 1298 1300 1302 1303 1305 1306